{
  "_name_or_path": "dccuchile/distilbert-base-spanish-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "FUGA",
    "1": "BAJO NIVEL",
    "2": "CHEQUEO",
    "3": "BAJA PRESION",
    "4": "FALLA FUNCIONAL",
    "5": "DESGASTE",
    "6": "FUERA DE AJUSTE",
    "7": "DEFECTUOSO",
    "8": "ALTA TEMPERATURA",
    "9": "ROTURA",
    "10": "PM-NORMALIZAR",
    "11": "FALLA VALVULA",
    "12": "SOLTURA",
    "13": "FALLA CONEXION/AISLAMIENTO",
    "14": "TRASPASO",
    "15": "BAJA POTENCIA",
    "16": "SIN PARTIDA",
    "17": "FALLA COMPONENTE",
    "18": "CORTO CIRCUITO",
    "19": "PINCHADO",
    "20": "FALLA ESTRUCTURAL",
    "21": "FILTRO SATURADO",
    "22": "PM-CAMBIO",
    "23": "CONTAMINADO",
    "24": "ALARMA",
    "25": "AJUSTE DEFICIENTE",
    "26": "FALLA ELECTRICA"
  },
  "initializer_range": 0.02,
  "label2id": {
    "AJUSTE DEFICIENTE": 25,
    "ALARMA": 24,
    "ALTA TEMPERATURA": 8,
    "BAJA POTENCIA": 15,
    "BAJA PRESION": 3,
    "BAJO NIVEL": 1,
    "CHEQUEO": 2,
    "CONTAMINADO": 23,
    "CORTO CIRCUITO": 18,
    "DEFECTUOSO": 7,
    "DESGASTE": 5,
    "FALLA COMPONENTE": 17,
    "FALLA CONEXION/AISLAMIENTO": 13,
    "FALLA ELECTRICA": 26,
    "FALLA ESTRUCTURAL": 20,
    "FALLA FUNCIONAL": 4,
    "FALLA VALVULA": 11,
    "FILTRO SATURADO": 21,
    "FUERA DE AJUSTE": 6,
    "FUGA": 0,
    "PINCHADO": 19,
    "PM-CAMBIO": 22,
    "PM-NORMALIZAR": 10,
    "ROTURA": 9,
    "SIN PARTIDA": 16,
    "SOLTURA": 12,
    "TRASPASO": 14
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "vocab_size": 31002
}
