{
  "_name_or_path": "dccuchile/distilbert-base-spanish-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "ESPEJO",
    "1": "TOLVA",
    "2": "SUSPENSION_DELANTERA",
    "3": "CONVERTIDOR_DE_TORQUE",
    "4": "TANQUE_HIDRAULICO_DIRECCION",
    "5": "MOTOR_DE_PARTIDA",
    "6": "FOCOS",
    "7": "ACUMULADOR_DE_FRENO",
    "8": "SENSORES_Y_SWITCH_MOTOR",
    "9": "ASIENTO",
    "10": "LINEAS_DE_FRENO",
    "11": "LINEAS_ENFRIAMIENTO",
    "12": "INYECTORES",
    "13": "CARTER",
    "14": "ACUMULADOR_DE_DIRECCION",
    "15": "LINEAS_HIDRAULICO_DIRECCION",
    "16": "PUERTA",
    "17": "COUPLING",
    "18": "VALVULAS_COMBUSTIBLE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ACUMULADOR_DE_DIRECCION": 14,
    "ACUMULADOR_DE_FRENO": 7,
    "ASIENTO": 9,
    "CARTER": 13,
    "CONVERTIDOR_DE_TORQUE": 3,
    "COUPLING": 17,
    "ESPEJO": 0,
    "FOCOS": 6,
    "INYECTORES": 12,
    "LINEAS_DE_FRENO": 10,
    "LINEAS_ENFRIAMIENTO": 11,
    "LINEAS_HIDRAULICO_DIRECCION": 15,
    "MOTOR_DE_PARTIDA": 5,
    "PUERTA": 16,
    "SENSORES_Y_SWITCH_MOTOR": 8,
    "SUSPENSION_DELANTERA": 2,
    "TANQUE_HIDRAULICO_DIRECCION": 4,
    "TOLVA": 1,
    "VALVULAS_COMBUSTIBLE": 18
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "vocab_size": 31002
}
