{
  "_name_or_path": "dccuchile/distilbert-base-spanish-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "MCM",
    "1": "MCV",
    "2": "MCE",
    "3": "MPV",
    "4": "MPO",
    "5": "MCI",
    "6": "MP",
    "7": "MCA",
    "8": "MCR"
  },
  "initializer_range": 0.02,
  "label2id": {
    "MCA": 7,
    "MCE": 2,
    "MCI": 5,
    "MCM": 0,
    "MCR": 8,
    "MCV": 1,
    "MP": 6,
    "MPO": 4,
    "MPV": 3
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "vocab_size": 31002
}
