{
  "_name_or_path": "dccuchile/distilbert-base-spanish-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "MAQUINA",
    "1": "MOTOR",
    "2": "TREN_DE_FUERZA",
    "3": "NEUMATICOS_Y_AROS",
    "4": "FRENOS",
    "5": "DIRECCION",
    "6": "NEUMATICOS",
    "7": "LEVANTE",
    "8": "TREN_DE_POTENCIA",
    "9": "TECNOLOGIA",
    "10": "PM",
    "11": "ACCIDENTE"
  },
  "initializer_range": 0.02,
  "label2id": {
    "ACCIDENTE": 11,
    "DIRECCION": 5,
    "FRENOS": 4,
    "LEVANTE": 7,
    "MAQUINA": 0,
    "MOTOR": 1,
    "NEUMATICOS": 6,
    "NEUMATICOS_Y_AROS": 3,
    "PM": 10,
    "TECNOLOGIA": 9,
    "TREN_DE_FUERZA": 2,
    "TREN_DE_POTENCIA": 8
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.28.1",
  "vocab_size": 31002
}
